# print(3 + 5 + 6)
# print((3 + 5 + 6) * 12)
# print(((3 + 5 + 6) * 12) + 3)
# print((((3 + 5 + 6) * 12) + 3) / 45)
#
# a = 3 + 5 + 6  # 这里的a就是一个变量. 临时记录一个值. 供后面的程序继续使用执行
# print(a * 12)  # 用完了
#
# a = 'hello python'
# print(a)

# a = 23
# print(a)
#
# b = a   # 执行顺序. 把等号右边的值赋值给等号左边的变量
# print(b)

# a = 20
# b = a
# a = 30
# print(b)

# a = 10
# print(a / 3)
#
# a = 'python'
# print(a / 3)

# 变量的数据类型(3个)
# 1. int类型. 整数, 可以进行+,-,*,/,%(计算余数, 取模), //(整除)
# print(9223372036854775807 * 128)
# print(10 % 3)
# print(10 // 3)
# print(10 / 3)  # 1-10000000000,0-1

# 2. str 字符串, ',',''',''' 括起来的内容叫字符串
# str1 = '''黑吃'''
# type()来查看变量的数据类型
# str1 = 18
# print(type(str1))

s = '''看破人生梦一度，也只好携琴揽酒观山望水纸扇长衫笑天涯！'''
print(s)

'''
注释: 多行注释. 不会影响你的程序执行. 给人看的. 
'''

# 字符串可以进行的操作: + *
# print('马化腾' + '马云')
# print('马化腾' + 2)  # 会报错.  字符串str和整型int不是一回事儿
# print('马化腾' * 4)

# 3.bool 布尔. 真命题或者假命题, True,False. 只能用来条件的判断