# s = "仁义礼智信"
# print(s[0])
# print(s[1])
# print(s[2])
# print(s[3])
# print(s[4])
# print(s[5])  # 索引不能超过边界
#
# print(s[-1]) # 倒数第一个
# print(s[-2])
# print(s[-3])
# print(s[-4])
# print(s[-5])

# 切片 [起始位置: 结束位置] 1.顾头不顾尾, 2.从左往右切

s = '不闻干戈心不乱，利锁名缰挂山墙。老大人衣紫腰金食王禄，小学徒煎炒烹炸下厨忙。'
print(s[1:3])  # 从1切到3. 但是取不到3  [1,3)
print(s[1:])  # 从1开始切. 切到结尾
print(s[:2])  # 从头切到2
print(s[:])  # 从头到尾
print(s[-3:-1])  # 只能从左往右切

# 给出第三个参数来控制方向,第三个参数叫步长
print(s[-1:-3:-1])  # - 表示反方向. 从右往左切
print(s[4:10:3])
print(s[-3:-9:-2])